# Игрок
# Карта
# Коллода
# Дилер
# Игрок:
# 1. Установить имя
# 2. Выдать карты (массив 2х случайных карт)
# 3. Кол-во очков
#     Массив карт
# Текущие карты
# 4. Счет / Деньги
# 5. Ставка
# 6. Пропустить
# 7. Добавить карту
# 8. Открыть карты

# Класс - контроллер
# 9. Сумма очков
# Коллода:
#     Массив объектов карты
# Убрать карту
# Добавить карту
# Сбросить игру / обновить карты
# Карта:
#     Наименование
# Кол-во очков
# Дилер:
#     2. Выдать карты (массив 2х случайных карт)
# 3. Кол-во очков
# 4. Счет / Деньги
# 5. Ставка
# 6. Пропустить
# 7. Добавить карту
# 8. Сумма очков
# Контроллер:
#     Подсчет очков
# Сброс-рестарт игры
# Вызов интерфейса
# Вызов методов классов
# Сдача карт

require_relative 'gamer'

class Dealer < Gamer

end
